'use strict';
//функция преобразования абсолютных данных в относительные и передача их в view

//функиця преобразования относительных данных в абсолютные и передача их в model

//работа с нецифровыми значениями (с массивом значений??)

class Presenter {

    constructor() {

    }

    changeViewListener() {
        //функция получает сообщения об изменении в View и передает в model
    }

    changeModelListener() {
        //функция получает сообщения об изменении данных в Model (изменение данных "налету")
        //и передает сообщения на изменения в View
    }

}